x='Helloworld!'# обьявляем переменную
y=x# закрепляем переменную в другой переменной для уверенности
c=True#для дальнейшей проверки

if ( x==y ):#проверяем равенство
    y==x      # первая проверка успешно пройдена 🎊🥳🎉
else:
    """подставляем к иксу значение нуль, просто рандомное значением"""
    x=0#выводим

#еще одна проверка, уже с булевым.
if ((x==y)   and ( c==True)):
    f   = 'Hello World!'
    print(f )
else:
    virtual =False

"""отлично. Код проходит все проверки: с дополнительной переменной и булевым значением. Код готов к исполнению: корректно выражает то, что я хотел вывести для пользователя."""